app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'The Terminator' LIMIT 1
---
  def show_by_title
    #debugger
    #movies = Movie.where :title => params[:title]
    @movie = Movie.find_by_title(params[:title])

SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'Aladdin' LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Bozo'
---
  def similar_director
    debugger
    @movie = Movie.find_by_title(params[:title])
    if !@movie.director.nil?
      @movies = Movie.find_all_by_director(@movie.director)

SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'Aladdin' LIMIT 1
---
  def edit_by_title
    #debugger
    #movies = Movie.where :title => params[:title]
    @movie = Movie.find_by_title(params[:title])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "director" = 'Bozo', "updated_at" = '2013-08-08 02:36:36.872940' WHERE "movies"."id" = 1
---
  def update
    @movie = Movie.find params[:id]
    params[:movie][:director] = nil if params[:movie][:director] == ''
    @movie.update_attributes!(params[:movie])